# Taps
tap "nikitabobko/tap"
tap "FelixKratz/formulae"
tap "dmmulroy/tap"

# CLI tools
brew "git"
brew "gh"
brew "jj"
brew "jq"
brew "ag"
brew "neovim"
brew "gnu-sed"
brew "cmake"
brew "ripgrep"
brew "git-delta"
brew "fd"
brew "fzf"
brew "tree"
brew "direnv"
brew "mise"
brew "starship"
brew "dmmulroy/tap/jj-starship"
brew "lua"
brew "bat"
brew "eza"
brew "lazygit"
brew "zoxide"
brew "atuin"
brew "zsh-autosuggestions"
brew "yazi"
brew "glow"
brew "poppler"
brew "zsh-syntax-highlighting"
brew "tree-sitter"
brew "tree-sitter-cli"

# Window management
cask "nikitabobko/tap/aerospace"
brew "borders"  # JankyBorders

# Applications
cask "claude"
# claude-code: installed via native installer (auto-upgrades) — curl -fsSL https://claude.ai/install.sh | bash
cask "codex"
cask "alfred"
cask "wezterm"
cask "iterm2"
cask "slack"
cask "zoom"
cask "visual-studio-code"
cask "postman"
cask "figma"
cask "spotify"
cask "macdown"

# Fonts
cask "font-fira-code-nerd-font"

# QuickLook plugins
cask "qlcolorcode"      # syntax highlighting
cask "qlstephen"        # plain text files without extension
cask "qlmarkdown"       # markdown preview
cask "quicklook-csv"    # CSV preview
cask "qlvideo"          # video thumbnails
cask "ipynb-quicklook"  # Jupyter notebooks
