# Taps
tap "nikitabobko/tap"
tap "FelixKratz/formulae"

# CLI tools
brew "git"
brew "gh"
brew "jj"
brew "jq"
brew "ag"
brew "neovim"
brew "gnu-sed"
brew "cmake"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "tree"
brew "direnv"
brew "mise"
brew "starship"
brew "lua"
brew "tree-sitter"
brew "tree-sitter-cli"

# Window management
cask "nikitabobko/tap/aerospace"
brew "borders"  # JankyBorders

# Applications
cask "claude-code"
cask "alfred"
cask "iterm2"
cask "slack"
cask "zoom"
cask "visual-studio-code"
cask "postman"
cask "figma"
cask "spotify"
cask "macdown"

# Fonts
cask "font-fira-code-nerd-font"

# QuickLook plugins
cask "qlcolorcode"      # syntax highlighting
cask "qlstephen"        # plain text files without extension
cask "qlmarkdown"       # markdown preview
cask "quicklook-csv"    # CSV preview
cask "qlvideo"          # video thumbnails
cask "ipynb-quicklook"  # Jupyter notebooks
